# Exercises I

 * Run python -m pip install pymysql from your terminal to install the mysql client (any folder is fine)
 * cd into your exercises folder for this module and run echo env.py >> .gitignore
 * Create a function named get_db_url. It should accept a username, hostname, password, and database name and return a url connection string formatted like in the example at the start of this lesson.
 * Use your function to obtain a connection to the employees database.
 
* Intentionally make a typo in the database url. What kind of error message do you see?

* Intentionally make an error in your SQL query. What does the error message look like?
 
* Read the employees and titles tables into two separate DataFrames.

In [1]:
from env import user, password, host
import pandas as pd
import numpy as np

In [2]:
def get_db_url(db):
    return f'mysql+pymysql://{user}:{password}@{host}/{db}'

In [3]:
sql = '''
SELECT *
FROM employees
LIMIT 10
'''

In [4]:
df = pd.read_sql(sql, get_db_url('employees'))

In [5]:
df.head()

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [6]:
sql_e = 'SELECT * FROM employees'
sql_t = 'SELECT * FROM titles'

In [18]:
df_e = pd.read_sql(sql_e, get_db_url('employees'))

In [19]:
df_t = pd.read_sql(sql_t, get_db_url('employees'))

In [21]:
df_t.head()

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

In [20]:
df_e.head()

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

### How many rows and columns do you have in each DataFrame? Is that what you expected?

In [22]:
df_t.shape

(443308, 4)

In [23]:
df_e.shape

(300024, 6)

### Display the summary statistics for each DataFrame.

In [24]:
df_t.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 443308 entries, 0 to 443307
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   emp_no     443308 non-null  int64
 1   title      443308 non-null  object
 2   from_date  443308 non-null  object
 3   to_date    443308 non-null  object
dtypes: int64(1), object(3)
memory usage: 13.5+ MB

In [25]:
df_e.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300024 entries, 0 to 300023
Data columns (total 6 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   emp_no      300024 non-null  int64
 1   birth_date  300024 non-null  object
 2   first_name  300024 non-null  object
 3   last_name   300024 non-null  object
 4   gender      300024 non-null  object
 5   hire_date   300024 non-null  object
dtypes: int64(1), object(5)
memory usage: 13.7+ MB

In [29]:
df_t.describe()

              emp_no
count  443308.000000
mean   253075.034430
std    161853.292613
min     10001.000000
25%     84855.750000
50%    249847.500000
75%    424891.250000
max    499999.000000

In [30]:
df_e.describe()

              emp_no
count  300024.000000
mean   253321.763392
std    161828.235540
min     10001.000000
25%     85006.750000
50%    249987.500000
75%    424993.250000
max    499999.000000

### How many unique titles are in the titles DataFrame?

In [ ]:
pd.read_sql('SELECT COUNT(DISTINCT title) AS unique_title_count FROM titles', URL)

In [38]:
df_t.title.nunique()

7

### What is the oldest date in the to_date column?

In [ ]:
pd.read_sql('SELECT MIN(to_date) FROM titles', url)

In [40]:
df_t.to_date.min()

datetime.date(1985, 3, 1)

### What is the most recent date in the to_date column?

In [41]:
df_t.to_date.max()

datetime.date(9999, 1, 1)

# Exercises II
* Copy the users and roles DataFrames from the examples above(in the curriculum).

### What is the result of using a right join on the DataFrames?

### What is the result of using an outer join on the DataFrames?

### What happens if you drop the foreign keys from the DataFrames and try to merge them?

### Load the mpg dataset from PyDataset.
* Output and read the documentation for the mpg dataset.

### How many rows and columns are in the dataset?

### Check out your column names and perform any cleanup you may want on them.

### Display the summary statistics for the dataset.

### How many different manufacturers are there?

### How many different models are there?

### Create a column named mileage_difference like you did in the DataFrames exercises; this column should contain the difference between highway and city mileage for each car.

### Create a column named average_mileage like you did in the DataFrames exercises; this is the mean of the city and highway mileage.

### Create a new column on the mpg dataset named is_automatic that holds boolean values denoting whether the car has an automatic transmission.

### Using the mpg dataset, find out which which manufacturer has the best miles per gallon on average?

### Do automatic or manual cars have better miles per gallon?

# Exercises III